Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Банки/Ext/ManagerModule.bsl
// Функция формирует результат запроса по классификатору банков
// с отбором по МФО, корреспондентскому счету, наименованию или городу.
//
// Параметры:
//	МФО - Строка - МФО банка
//	КорСчет - Строка - Корреспондентский счет банка
//	Наименование - Строка - Наименование банка
//	Город - Строка - Город банка
//	Область - Строка - Область банка
//
// Возвращаемое значение:
//	РезультатЗапроса - Результат запроса по классификатору.
//
Функция ПолучитьРезультатЗапросаПоКлассификатору(МФО, КоррСчет, Наименование, Город, Область) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Макет = Справочники.Банки.ПолучитьМакет("КлассификаторБанков");
	Макет.Записать(ИмяВременногоФайла);  
	КлассификаторТаблица = ЗначениеИзФайла(ИмяВременногоФайла);
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(КлассификаторТаблица);
	
	Отбор = ПостроительЗапроса.Отбор;
	
	Если ЗначениеЗаполнено(МФО) Тогда
		Отбор.Добавить("МФО");
		Отбор.МФО.Значение = СокрЛП(МФО);
		Отбор.МФО.ВидСравнения = ВидСравнения.Содержит;
		Отбор.МФО.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоррСчет) Тогда
		Отбор.Добавить("КоррСчет");
		Отбор.КоррСчет.Значение = СокрЛП(КоррСчет);
		Отбор.КоррСчет.ВидСравнения = ВидСравнения.Содержит;
		Отбор.КоррСчет.Использование = ЗначениеЗаполнено(КоррСчет);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Отбор.Добавить("Наименование");
		Отбор.Наименование.Значение = СокрЛП(Наименование);
		Отбор.Наименование.ВидСравнения = ВидСравнения.Содержит;
		Отбор.Наименование.Использование = ЗначениеЗаполнено(Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Город) Тогда
		Отбор.Добавить("Город");
		Отбор.Город.Значение = СокрЛП(Город);
		Отбор.Город.ВидСравнения = ВидСравнения.Содержит;
		Отбор.Город.Использование = ЗначениеЗаполнено(Город);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Область) Тогда
		Отбор.Добавить("Область");
		Отбор.Область.Значение = СокрЛП(Область);
		Отбор.Область.ВидСравнения = ВидСравнения.Содержит;
		Отбор.Область.Использование = ЗначениеЗаполнено(Область);
	КонецЕсли;
	
    ПостроительЗапроса.Выполнить();
    РезультатЗапроса = ПостроительЗапроса.Результат;

	Возврат РезультатЗапроса;

КонецФункции // ПолучитьРезультатЗапросаПоКлассификатору()

// Процедура добавляет новый банк из классификатора
// по значению МФО или корреспондентскому счету.
//
// Параметры:
//	МФО - Строка - МФО банка
//	КоррСчет - Строка - Корреспондентский счет банка
//	ТаблицаБанков - ТаблицаЗначений - Таблица банков
//
Процедура ДобавитьБанкиИзКлассификатора(МФО, КоррСчет, ТаблицаБанков)

	РезультатЗапроса = Справочники.Банки.ПолучитьРезультатЗапросаПоКлассификатору(
		МФО,
		КоррСчет,
		, // Наименование
		, // Город
		, // Область 
	);
	
	МассивБанков = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
    
    	БанкОбъект = Справочники.Банки.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(БанкОбъект, Выборка);
		БанкОбъект.Код = Выборка.МФО;
		БанкОбъект.Записать();
		
		НоваяСтрока = ТаблицаБанков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, БанкОбъект);
    
    КонецЦикла;
    
КонецПроцедуры // ДобавитьБанкиИзКлассификатора()

// Функция получает таблицу ссылок на банки по МФО или корреспондетскому счету.
//
// Параметры:
//	Поле - Строка - Имя поля (МФО или КоррСчет)
//	Значение - Строка - Значение МФО или Корреспондентского счета
//
// Возвращаемое значение:
//	ТаблицаЗначений - Найденые банки
//
Функция ПолучитьТаблицуБанковПоРеквизитам(Поле, Значение) Экспорт
	
	ТаблицаБанков = Новый ТаблицаЗначений;
	Колонки = ТаблицаБанков.Колонки;
	Колонки.Добавить("Ссылка");
	Колонки.Добавить("Код");
	Колонки.Добавить("КоррСчет");
	
	ЭтоМФО = Ложь;
	ЭтоКоррСчет = Ложь;
	Если Найти(Поле, "МФО") <> 0 Тогда
		ЭтоМФО = Истина;
	ИначеЕсли Найти(Поле, "КоррСчет") <> 0 Тогда
		ЭтоКоррСчет = Истина;
	КонецЕсли;
	
	Если (ЭтоМФО И СтрДлина(Значение) = 6)
	 ИЛИ (ЭтоКоррСчет И СтрДлина(Значение) = 20)
	Тогда
		
		Если ЭтоМФО Тогда
			СтруктураОтбора = Новый Структура("Код", Значение);
			
		ИначеЕсли ЭтоКоррСчет Тогда
			СтруктураОтбора = Новый Структура("КоррСчет", Значение);
			
		КонецЕсли;
		
		Выборка = Справочники.Банки.Выбрать(,, СтруктураОтбора, "Код Возр");
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаБанков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
		Если ТаблицаБанков.Количество() = 0 Тогда
			ДобавитьБанкиИзКлассификатора(
				?(ЭтоМФО, Значение, ""), // МФО
				?(ЭтоКоррСчет, Значение, ""), // КоррСчет
				ТаблицаБанков
			);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаБанков;
	
КонецФункции // ПолучитьТаблицуБанковПоРеквизитам()
